Validation_Cases/IncompressibleNACA0012/00/Fine_negSA/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3941;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    
    momErr
    {
        type        momentumError;
        libs        (fieldFunctionObjects);
        executeControl  writeTime;
        writeControl    writeTime;
    }

    contErr
    {
        type        div;
        libs        (fieldFunctionObjects);
        field       phi;
        executeControl  writeTime;
        writeControl    writeTime;
    }

    #include "yPlus"
    //#include "wallShearStress"
    #include "forceCoeffs"
    #include "turbulenceField"
    #include "forceCoeffTrigger"

}

libs ("libmyIncompressibleTurbulenceModels.so");
// ************************************************************************* //
